a=4.186
b=int(input('Введіть масу води яку потріно нагріти або охлодити(г,мл ):'))
c=int(input('Введіть кількість градусів на скільки потрібно нагріти або охолодити воду:'))
ds=str(input('Введіть що потрібно робити(нагрівати, охолоджувати):'))
if ds=='нагрівати':
    q=a*b*c
    print('Потрібно передати воді',q,'Дж енергії')
    v=q*2.778*(10**(-7))*1.33
    print('Це буде коштувати',v,'гривень')
elif ds=='охолоджувати':
    q=a*b*c
    print('Потрібно забрати у води',q,'Дж енергії')
import datetime
def printTimeStamp(name):
    print('Автор програми: ' + name)
    print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp('Дворяківська Єлизавета')
