a=int(input('Введіть рівень шуму, дБ:'))
if a<40:
    print('Рівень шуму нижчий за рівень шуму в тихій кімнаті')
elif a==40:
    print('Рівень шуму відповідає рівню шуму в тихій кімнаті')
elif a>40 and a<70:
    print('Рівень шуму знаходиться між рівнями шуму тихої кімнати та будильника')
elif a==70:
    print('Рівень шуму відповідає рівню шуму будильника')
elif a>70 and a<106:
    print('Рівень шуму знахдиться між рівнями шуму будильника і бензинової газонокосарки')
elif a==106:
    print('Рівень шуму відповідає рівню шуму бензинової газонокосарки')
elif a>106 and a<130:
    print('Рівень шуму знаходиться між рівнями шуму бензинової газонокосарки та відбійного молотка')
elif a==130:
    print('Рівень шуму відповідає рівню шуму відбійного молотка')
elif a>130:
    print('Рівень шуму більший за рівень шуму відбійного молотка')
import datetime
def printTimeStamp(name):
    print('Автор програми: ' + name)
    print('Час компіляції: ' + str(datetime.datetime.now()))
printTimeStamp('Дворяківська Єлизавета')
